namespace CSharpTasks
{
    internal class Program
    {
        /* Описание задачи
         * Нарисовать картинку 100x100 пикселей рандомного цвета
         *
         * Для работы с картинкой использовать следующее:
         * Добавить nuGet пакет System.Drawing.Common
         * Для использования объектов этого пакета описать вверху файла новый using
         * Для создания объекта картинки использовать Bitmap
         * Для покраски пикселя использовать Bitmap.SetPixel()
         * Для сохранения картинки использовать Bitmap.Save()
        */

        static void Main(string[] args)
        {

        }
    }
}