namespace CSharpTasks
{
    internal class Program
    {
        /* Описание задачи
         * Пользователь вводит <текст>, затем <буква>
         * Программа выводит эту строку, удаляя букву из строки
         * Запрещено использовать string.Replace()
         *
         * Пример ввода:
         * <текст>:     Программируем на C# вместе с котом
         * <буква>:     о
         *
         * Итоговый вывод:
         * Прграммируем на C# вместе с ктм
        */

        static void Main(string[] args)
        {

        }
    }
}