namespace CSharpTasks
{
    internal class Program
    {
        /* Описание задачи
         * Пользователь вводит строку. Программа выводит эту строку, выравнивая ее по центру консоли
         *
         * Пример ввода:
         * <ввод>:
         * ------------------------------------------------------------------------------------------------------
         * |Всем привет!                                                                                        |
         * ------------------------------------------------------------------------------------------------------
         *
         * Итоговый вывод:
         * ------------------------------------------------------------------------------------------------------
         * |                                             Всем привет!                                           |
         * ------------------------------------------------------------------------------------------------------
        */

        static void Main(string[] args)
        {

        }
    }
}