namespace CSharpTasks
{
    internal class Program
    {
        /* Описание задачи
         * Пользователь вводит строку. Программа выводит эту строку, выравнивая ее по центру консоли
         *
         * Пример ввода:
         * <ввод>:
         * ------------------------------------------------------------------------------------------------------
         * |Всем привет!                                                                                        |
         * ------------------------------------------------------------------------------------------------------
         *
         * Итоговый вывод:
         * ------------------------------------------------------------------------------------------------------
         * |                                             Всем привет!                                           |
         * ------------------------------------------------------------------------------------------------------
        */

        static void Main(string[] args)
        {
            int origWidth, width;

            origWidth = Console.WindowWidth;

            width = origWidth / 2;

            string vvedi = Console.ReadLine();

            int kostil = vvedi.Length / 2;

            Console.WriteLine(vvedi.PadLeft(width + kostil));

            Console.ReadLine();
        }
    }
}